In [5]:
#FIltering out missing data
#Series
import pandas as pd
from numpy import nan as NA
import numpy as np

In [5]:
data=pd.Series([1,NA,2,NA,4])

In [6]:
data.dropna()

0    1.0
2    2.0
4    4.0
dtype: float64

In [7]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [9]:
data[data.notnull()]

0    1.0
2    2.0
4    4.0
dtype: float64

In [10]:
data.isna()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [11]:
#DataFrame

In [12]:
data=pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned=data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
#USing dropna you can keep the thresh on dataframe and slect the number of NA allowed per row

In [8]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [1]:
#Filling Missing Data

In [10]:
df

          0         1         2
0  0.356508       NaN       NaN
1  1.954957       NaN       NaN
2  1.309954       NaN -0.760783
3  0.955834       NaN -0.210723
4 -1.081755  0.408470  0.686781
5  0.187929 -0.944430  0.010265
6 -0.609502 -0.312694 -1.152536

In [11]:
df.fillna(0)

          0         1         2
0  0.356508  0.000000  0.000000
1  1.954957  0.000000  0.000000
2  1.309954  0.000000 -0.760783
3  0.955834  0.000000 -0.210723
4 -1.081755  0.408470  0.686781
5  0.187929 -0.944430  0.010265
6 -0.609502 -0.312694 -1.152536

In [14]:
df.fillna({1:1.5,2:3})

          0         1         2
0  0.356508  1.500000  3.000000
1  1.954957  1.500000  3.000000
2  1.309954  1.500000 -0.760783
3  0.955834  1.500000 -0.210723
4 -1.081755  0.408470  0.686781
5  0.187929 -0.944430  0.010265
6 -0.609502 -0.312694 -1.152536

In [15]:
df.fillna(0,inplace=True)

In [16]:
df

          0         1         2
0  0.356508  0.000000  0.000000
1  1.954957  0.000000  0.000000
2  1.309954  0.000000 -0.760783
3  0.955834  0.000000 -0.210723
4 -1.081755  0.408470  0.686781
5  0.187929 -0.944430  0.010265
6 -0.609502 -0.312694 -1.152536

In [18]:
df=pd.DataFrame(np.random.randn(6,3))

In [19]:
df.iloc[2:,1]=NA

In [20]:
df.iloc[4:,2]=NA

In [21]:
df

          0         1         2
0 -0.944299 -0.751821 -0.379822
1 -0.189806  0.061167 -0.138764
2 -0.657770       NaN  0.451037
3 -0.942184       NaN -0.319745
4 -0.892925       NaN       NaN
5 -0.333807       NaN       NaN

In [22]:
df.fillna(method='ffill')

          0         1         2
0 -0.944299 -0.751821 -0.379822
1 -0.189806  0.061167 -0.138764
2 -0.657770  0.061167  0.451037
3 -0.942184  0.061167 -0.319745
4 -0.892925  0.061167 -0.319745
5 -0.333807  0.061167 -0.319745

In [23]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.944299 -0.751821 -0.379822
1 -0.189806  0.061167 -0.138764
2 -0.657770  0.061167  0.451037
3 -0.942184  0.061167 -0.319745
4 -0.892925       NaN -0.319745
5 -0.333807       NaN -0.319745

In [24]:
#Data Transformation

In [25]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [26]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
#Transforming Data Using a Function or Mapping

In [32]:
data=pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [33]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon' 
}

In [37]:
lowercased=data['food'].str.lower()

In [38]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [39]:
data['animal']=lowercased.map(meat_to_animal)

In [40]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [41]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [43]:
#Replacing Values

In [44]:
#Transforming Axis

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [48]:
bins=[18,25,35,60,100]

In [49]:
cats=pd.cut(ages,bins)

In [50]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
q